import 'package:adhar_loan_2/ad_controller/back_ad_controller.dart';
import 'package:adhar_loan_2/ad_controller/google_ads.dart';
import 'package:adhar_loan_2/ad_controller/main_ad_controller.dart';
import 'package:adhar_loan_2/controller/widget_controller.dart';
import 'package:adhar_loan_2/media/qury.dart';
import 'package:flutter/material.dart';


class PanCard extends StatefulWidget {
  const PanCard({super.key});

  @override
  State<PanCard> createState() => _PanCardState();
}

class _PanCardState extends State<PanCard> {
  @override
  Widget build(BuildContext context) {
    return WillPopScope(
      onWillPop: () =>
          backbuttoncontroller.showBackbuttonad(context, '/PanCard', ''),
      child: Scaffold(
        backgroundColor: Colors.white,
        appBar: controllerAppbar.getappbar('Pan Card', () {
          backbuttoncontroller.showBackbuttonad(context, '/PanCard', '');
        }),
        body: Stack(
          children: [
            SingleChildScrollView(
              physics: const BouncingScrollPhysics(),
              child: Column(
                children: [
                  Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: ListView.builder(
                      shrinkWrap: true,
                      itemCount: title.length,
                      itemBuilder: (context, index) {
                        return GestureDetector(
                          onTap: () {
                            controller.showbuttonad(context, '/PanCardDeatils',
                                '/PanCard', [title[index], discrip[index]]);
                          },
                          child: Padding(
                            padding: const EdgeInsets.all(5),
                            child: Container(
                              color: Colors.blue,
                              height: ScreenSize.fSize_50(),
                              child: Row(
                                children: [
                                  SizedBox(width: ScreenSize.fSize_12()),
                                  controllerTextwhite.getText(
                                      '${title[index]}',
                                      ScreenSize.fSize_15(),
                                      FontWeight.w500),
                                ],
                              ),
                            ),
                          ),
                        );
                      },
                    ),
                  )
                ],
              ),
            ),
            banner.getBN('/PanCard')
          ],
        ),
      ),
    );
  }

  List title = [
    'पैन कार्ड क्या है',
    'पपैन कार्ड की बनावट',
    "पैन कार्ड के फायदे",
    "पैन कार्ड क्या काम आता है?",
    "पैन कार्ड क्यों जरुरी है?",
    "पैन कार्ड के बिना व्यक्तिगत ऋण कैसे प्राप्त करें?",
    "पैन कार्ड के बिना इंस्टेंट लोन का लाभ उठाने के लिए क्या करें",
  ];
  List discrip = [
    """पैन कार्ड का पूरा नाम Permanent Account Number होता है. ये एक identification कार्ड होता है जिसे हर तरह के फाइनेंसियल लेन देन (transaction) के लिए इस्तेमाल किया जाता है. ये एक यूनिक कार्ड है जिसमे 10 alphanumerical character होते हैं जिसे इनकम टैक्स या आयकर विभाग हमें देती है. पैन कार्ड Indian Income tax Act, 1961 के तहत लैमिनेटेड कार्ड के रूप में इशू किया जाता है. इसे Central Board of Direct Taxes (CBDT) की देख रेख में जारी किया जाता है. पैन कार्ड आइडेंटिफिकेशन प्रूफ के रूप में हमारे बहुत काम आता है. इस के जरिये इंडियन गवर्नमेंट इनकम टैक्स के बारे में पूरी जानकारी हासिल करती है. पैन कार्ड हर तरह की फाइनेंसियल लेन देन के काम आता है.इसके जरिये इनकम टैक्स भुगतान, नया बैंक अकाउंट खुलवाने में, टैक्सेबल सैलरी रिसीव करने के लिये, जायदाद की ख़रीद बिक्री करने में जरुरत पड़ती है. ये एक पहचान पत्र की तरह काम करता है लेकिन इसमें एड्रेस नहीं होता इसीलिए इसका इस्तेमाल एड्रेस प्रूफ की तरह नहीं होता है. ये दिखने में बिलकुल डेबिट/क्रेडिट कार्ड के साइज का होता है. इसमें आपका नाम, पिता का नाम, जन्म तारीख, पैन नंबर दर्ज किया हुआ होता है. इसके साथ ही इसमें फोटो और सिग्नेचर भी रहता है.""",
    """जैसा की पहले ही हम बात कर चुके हैं की पैन कार्ड 10 करैक्टर लम्बा अल्फा न्यूमेरिक यूनिक करैक्टर होते है. 1. हर पैन कार्ड नंबर एक दूसरे से अलग और यूनिक होता है. इसमें बहुत सारी जानकारी होती है. चलिए इसे उदाहरण से समझते हैं. इस नंबर कुछ इस तरह का होता है AAWA1234J 2. इसमे पहले के 5 letters इंग्लिश अल्फाबेट्स होते हैं उसके बाद 4 न्यूमेरिकल नंबर होते हैं और लास्ट में फिर एक इंग्लिश अल्फाबेट होता है 3. शुरू के 5 अल्फाबेट्स में पहले के 3 अल्फाबेट्स A-Z के बिच में कोई भी लेटर हो सकता है. 4. 4th अल्फाबेट्स निचे दिए लिस्ट के अनुसार चुना जाता है. कपनी के लिए – C किसी Person के लिए – P Hindi undivided family (HUF) के लिए – H Firm के लिए – F Association of persons के लिए (AOP) – A Trust के बारे में denote करने के लिए – T Individual के लिए (BOI) – B Local Authority – L Artificial Jurisdiction Person – J Government – G 5. 5thअल्फाबेट किसी भी person के surname या last name , किसी आर्गेनाईजेशन या कंपनी के नाम का पहला लेटर होता है. 6. इसके बाद 6-9 characters के जो 4 न्यूमेरिकल डिजिट्स होते हैं वो 0001 से लेकर 9999 के बिच में से लिए जाते हैं. 7. लास्ट डिजिट एक अल्फाबेट होता है जो पीछे के 9 characters के द्वारा एक फार्मूला अप्लाई कर के निकाला जाता है.""",
    """1. इनकम टैक्स में होने वाली प्रॉब्लम्स और गड़बड़ी से ये कार्ड बचाता है. 2. इँडियन गवर्नमेंट द्वारा इशू किया हुआ कार्ड हर जगह वैलिड है. हर सरकारी ऑफिस और बस ट्रैन हर जगह इसकी मान्यता है. 3. इसीलिए आप किसी भी सरकारी या प्राइवेट संस्था में इसे ID प्रूफ की तोर पर दे सकते है 4. Full time के अलावा पार्ट टाइम जॉब में भी इसको दिखाने से आपको भुगतान आसानी से हो जाता है. 5. अगर आप कहीं पर टेम्पररी जॉब या फिर पार्ट टाइम वर्क करते हैं तो इससे आप साल के लास्ट में TDS claim कर सकते है. 6. 50,000 से ज्यादा की लेन देन करने के लिये. 7. इससे शेयर मार्किट में 50,000 से ज्यादा की अमाउंट के ट्रांसक्शन करने मे. 8. किसी होटल में 25,000 से ज्यादा अमाउंट को Payकरने के लिए ये काम करता है.""",
    """यह हमारे लिए एक पहचान पत्र के रूप में काम करता है. जब कोई बैंक अकाउंट खुलवाने के लिए बैंक जाता है तो वहां पर पैन कार्ड जमा करना अनिवार्य है. इसके बिना बैंक अकाउंट नहीं खुल सकता है. इससे टैक्स की जानकारी मिलती है और सरकार को टैक्स चोरी होने उसकी जानकारी मिल जाती है. इसके अलावा कोई अगर बहुत सारी बैंक में अपना अकाउंट खुलवा आता है और उसे लगता है कि अलग-अलग अकाउंट में पैसा रखने से सरकार की नजर से बच जाएगा तो इसमें सबसे अहम भूमिका पैन कार्ड ही निभाता है. िससे सरकार को यह पता चल जाता है कि उसके या किसी इंसान के पास में कुल कितनी संपत्ति है.""",
    """परमानेंट अकाउंट नंबर हर नागरिक के लिए जरुरी है. बहुत सारे ऐसे काम है जो बिना इसके पॉसिबल नहीं है. यह एक तरह से हमारे लिए पहचान पत्र के रूप में काम करता है. इसमें हमारा नाम पिता का नाम और फोटो भी होता है जिसकी वजह से ये ID प्रूफ के लिए वैलिड होता है. इनकम टैक्स भरने के लिए इसका इस्तेमाल करते हैं. अगर ये न हो तो पता नहीं चलेगा की टैक्स का सही अमाउंट क्या है. ये unique नंबर के जरिये किसी व्यक्ति द्वारा किये गए सारे ट्रांसक्शन को रिकॉर्ड करते हैं. इससे टैक्स की चोरी रोकने में मदद मिलती है. जॉब करने वाले व्यक्ति के लिए ये और भी जरूरी होता है. जब ज्यादा प्राइस की किसी ट्रांसक्शन को करना होता है तो वहाँ पैन कार्ड की डिटेल देनी जरुरी है. बिना इसके ट्रांसक्शन नहीं कर सकते. नए बैंक अकाउंट ओपन करने के लिए इसको अनिवार्य कर दिया गया है. इंडिया के किसी भी बैंक में अकाउंट बनवाना है तो वो आप से ये जरूर माँगेंगे. टेलीफोन के नया कनेक्शन लेने में ये काम करता है. Property ख़रीदने या बेचने के लिए इसकी जरुरत पड़ती है, इसके साथ ही घर बनने और फ्लैट ख़रीदने के लिए इसका होना जरुरी है. Vehicle ख़रीदने के लिए भी ये काम आता है. Debit/Credit कार्ड पाने के लिए आपको इसकी जरुरत पड़ेगी.""",
    """पैन कार्ड 50,000 रुपये (निवेश, जमा, आदि) और रु .5 लाख (वाहन, आभूषण, आदि की खरीद) से अधिक के लेनदेन के लिए एक अनिवार्य आवश्यकता है। आयकर रिटर्न दाखिल करते समय यह एक आवश्यक दस्तावेज भी है और खाता खोलते समय या ऋण लेते समय केवाईसी के लिए एक अनिवार्य ओवीडी है। व्यक्तिगत खाते में अब केवल व्यक्तिगत ऋण के लिए आवेदन करने या इसके बजाय खाता खोलने के लिए 10 अंकों का पैन प्रदान किया जा सकता है। कार्ड की फोटोकॉपी जमा करना। इस तरह, पैन कार्ड के बिना एक व्यक्तिगत ऋण का लाभ उठाना एक चुनौती हो सकती है क्योंकि अधिकारी इसका उपयोग किसी व्यक्ति के वित्तीय ट्रैक करने और मौद्रिक धोखाधड़ी की जांच करने के लिए करते हैं। हालांकि, कुछ ऋणदाता ऋण की पेशकश करने के लिए तैयार हो सकते हैं। बिना पैन कार्ड के भी।""",
    """केवाईसी के लिए अन्य ओवीडी जमा करें पैन कार्ड के अभाव में, आवेदकों को अन्य केवाईसी दस्तावेज, विशेष रूप से आधार कार्ड जमा करने होंगे। पैन कार्ड के बिना व्यक्तिगत ऋण के लिए आवेदन करते समय आवेदक के स्थायी पते के साथ अन्य आधिकारिक दस्तावेज भी पर्याप्त हो सकते हैं। बैंक खाता विवरण और वेतन पर्ची प्रदान करें पैन कार्ड के बिना ऑनलाइन ऋण प्राप्त करने के लिए नवीनतम बैंक खाता विवरण जैसे आय विवरण आवश्यक हैं। ऋणदाता इन कथनों के साथ एक आवेदक की वर्तमान और पिछली वित्तीय स्थिति का आकलन करते हैं। ित्तीय संस्थान अपनी निश्चित मासिक आय और खर्चों की जांच कर सकते हैं ताकि पुनर्भुगतान क्षमता का स्पष्ट अवलोकन हो सके। बैंक खाता विवरणों के साथ नवीनतम वेतन पर्ची जमा करना भी अनिवार्य है। पर्याप्त मासिक आय वाले लोग अक्सर पैन कार्ड के बिना ऋण की मंजूरी के लिए वरीयता प्राप्त करते हैं। 750 या उससे ऊपर का CIBIL स्कोर रखें पैन कार्ड के बिना तत्काल पैसे के लिए आवेदन करने वाले व्यक्तियों को 750 या उससे अधिक का CIBIL स्कोर भी रखना होगा। एक उच्च स्कोर एक आवेदक की साख स्थापित करता है। यह व्यक्तिगत ऋणों पर आकर्षक ब्याज दरों को सुरक्षित रखने में भी मदद करता है। पैन कार्ड के अभाव में आवेदक का ध्वनि पुनर्भुगतान इतिहास भी होना चाहिए। देर से भुगतान और देरी इस मामले में एक बाधा बन सकती है। कम ऋण-से-आय अनुपात या एफओआईआर एक ऋण-से-आय अनुपात या आय अनुपात (एफओआईआर) के लिए निर्धारित बाध्यताएं उसकी / उसकी आय के खिलाफ एक व्यक्ति की निश्चित मासिक देनदारियों का प्रतिशत है। 50% के अनुपात का अर्थ है कि वह मासिक खर्चों को पूरा करने के लिए वेतन का आधा हिस्सा खर्च करता है। जैसे, डिस्पोजेबल आय में बाधा आती है, जिससे नए ऋण ईएमआई भुगतान को चुनौती मिलती है। इस प्रकार, आवेदकों को पैन कार्ड के बिना आसान ऋण प्राप्त करने की अपनी संभावनाओं को बेहतर बनाने के लिए अपने निश्चित मासिक ऋण को कम करने की योजना बनाना चाहिए। उपरोक्त बिंदुओं का अनुपालन करने से व्यक्तियों को पैन कार्ड के बिना व्यक्तिगत ऋण के लिए आवेदन करने में मदद मिल सकती है।""",
  ];
}
