// ignore_for_file: file_names

import 'package:adhar_loan_2/ad_controller/back_ad_controller.dart';
import 'package:adhar_loan_2/ad_controller/main_ad_controller.dart';
import 'package:adhar_loan_2/controller/widget_controller.dart';
import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';

import '../../../ad_controller/google_ads.dart';
import '../../../media/qury.dart';

class AadharCard extends StatefulWidget {
  const AadharCard({super.key});

  @override
  State<AadharCard> createState() => _AadharCardState();
}

class _AadharCardState extends State<AadharCard> {
  @override
  Widget build(BuildContext context) {
    return WillPopScope(
      onWillPop: () => backbuttoncontroller.showBackbuttonad(context, '/AadharCard', ''),
      child: Scaffold(
        backgroundColor: Colors.white,
        appBar: controllerAppbar.getappbar('Adhar Card', () {
          backbuttoncontroller.showBackbuttonad(context, '/AadharCard', '');
        }),
        body: Stack(
          children: [
            SingleChildScrollView(
              physics: const BouncingScrollPhysics(),
              child: Column(
                children: [
                  Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: ListView.builder(
                      physics: const NeverScrollableScrollPhysics(),
                      shrinkWrap: true,
                      itemCount: title.length,
                      itemBuilder: (context, index) {
                        return GestureDetector(
                          onTap: () {
                            controller.showbuttonad(
                                context, '/AadharCard1', '/AadharCard', [title[index],discrip[index]]);
                          },
                          child: Padding(
                            padding: const EdgeInsets.all(5),
                            child: Container(
                              color: Colors.blue,
                              height: ScreenSize.fSize_50(),
                              child: Row(
                                children: [
                                  SizedBox(width: ScreenSize.fSize_12()),
                                  Text(
                                    '${title[index]}',
                                    overflow: TextOverflow.ellipsis,
                                    style: GoogleFonts.k2d(
                                        color: Colors.white, fontSize:  ScreenSize.fSize_15(), fontWeight: FontWeight.w500),
                                  )
                                ],
                              ),
                            ),
                          ),
                        );
                      },
                    ),
                  ),
                  SizedBox(height: ScreenSize.fSize_80()),
                ],
              ),
            ),
            banner.getBN('/AadharCard')
          ],
        ),
      ),
    );
  }

  List title = [
    "आधार होने के फायदे?",
    "ऋण देने में आधार कार्ड का महत्व",
    "आधार कार्ड से ऑनलाइन लोन लेने के लिए कैसे अप्लाई करे",
    "आधार कार्ड लोन ऑनलाइन Apply करे",
    "आधार कार्ड के लाभ एक व्यक्तिगत ऋण प्राप्त करने के लिए",
    "आधार कार्ड से ऑनलाइन लोन लेने के लिए कैसे अप्लाई करे",
    "Importances of Aadhar Card for India",
    "Aadhar Card Home Loan",
    "ऑनलाइन आधार कार्ड से लोन लेने की कुछ शर्तें",
    "Aadhar Card Home Loan कैसे ले",
    "आधार कार्ड पर Online Loans लेने की योग्यता",
    "Loans के लिए आवेदन करे",
    "ऑनलाइन लोन लेने के लिए अप्लाई कैसे करे",
    "What is the benefit of Aadhar card?"
  ];
  List discrip = [
    """इस पहचान प्रमाण की आसान उपलब्धता और सार्वभौमिक स्वीकृति ने दैनिक जीवन के अधिकांश कार्यों को आसान बना दिया है | इसके अलावा, अद्रितीय संख्या के कारण , भ्रष्टाचार बहूत हद तक कम हो गया है | यहा आधार के सबसे महत्वपृर्ण लाभ है - 10 दिनों में पासपोर्ट - वोटर कार्ड लिंकिंग - नया बैंक खाता खोलना - जनधन खाता खोलने के लिये - एलपीजी की सबसीडी पाने के लिये - ट्रेन टिकट में छूट पाने के लिए - परीक्षाओं में बैठने के लिये (जैसे आईआईटी जेईई के लिये) - बच्चों को नर्सरी कक्षा में प्रवेश दिलाने के लिये - डिजिटल जीवन प्रमाणपत्र (लाइफ सर्टिफिकेट) के लिए आधार जरूरी -बिना आधार कार्ड के नहीं मिलेगा प्रविडेंट फंड -डिजिटल लॉकर के लिए आधार जरूरी -सम्पत्ति के रजिस्ट्रेशन के लिए भी आधार कार्ड जरूरी कर दिया गया है। -छात्रों को दी जाने वाली छात्रवृत्ति भी आधार कार्ड के जरिए ही उनके बैंक में जमा करवाई जाएगी। -सिम कार्ड खरीदने के लिये -आयकर रिटर्न""",
    """हालंकी अभी तक लोन लेने वालो के लिए आधार कार्ड देना अनिवार्य नहि किया गया है, फ़िर भी यह लोन प्रोसेसिंग को बहुत आसान बना सकता है | आधार कार्ड को आईडी प्रूफ के रूप मैं स्वीकार करने के बाद ऋण आवेदक के दस्तावेजों को सत्यापित करने के लिए बैंक अधिकारियो को जो समय और प्रयास करना था, वह काफी कम हो गया है | आधार कार्ड को आधारभूत डॉक्युमनेट के रूप मैं लेकर ऑनलाइन ऋण मैं ग्राहक का सत्यापन ई-केवाईसी के साथ किया जाता है | ऋण मैं आधार कार्ड का उपयोग ऋण देने का आधार है| ई-केवाईसी के माध्यम से आवेदक के ऑनलाइन सत्यापन कि वजह से तात्कालिक ऋण जो घंटो के भीतर वितरित किये जाने का दावा किया जाता है,सम्भव हो जाता है| ऑनलाइन ऋण जिन्हें बेहतर ऋण के रूप मैं जाना जाता है,को पहचान के लिए एकमात्र डॉक्युमनेट के रूप मैं अपने आधार कार्ड की स्कैन की हुई कॉपी को सजा करके भी प्राप्त किया जा सकता है|""",
    """आज के समय में एक ऐसी ID बहुत ज्यादा चलती है जोकि आज के समय बहुत ही फेमस ID हो चुकी है हां दोस्तों हम बात करें आधार कार्ड की आधार कार्ड में कैसे ID है जो कि किसी भी जगह किसी भी तरह की ID के लिए आप दे सकते हैं और यह आपकी संपूर्ण ID मानी जाती है आधार कार्ड के आधार पर आप किसी भी तरह की कोई भी चीज को उपलब्ध करवा सकते हैं और किसी से भी आधार कार्ड के जरिए आप कुछ भी ले सकते हैं अपना सिम ले सकते हैं या अपने बैंक अकाउंट खुलवा सकते हैं लोन ले सकते हैं गाड़ी ले सकते हैं गैस सिलेंडर ले सकते हैं और अपने किसी भी तरह के डाक्यूमेंट्स के अंदर आप आधार कार्ड को शामिल कर सकते हैं यह भारतीय सरकार का एक बहुत ही बड़ा फायदा यह है कि अगर आप किसी चीज को आधार कार्ड नंबर के आधार पर लेते हैं तो जब आप की चीज गुम हो जाती है या किसी कारणवश कहीं पर छूट जाती है तो उसके बाद आप उस चीज को अपने आधार कार्ड के साथ दोबारा से पा सकते हैं आधार कार्ड एक ऐसी चीज है जो कि आप हर चीज में यूज करते हैं जैसे आप अगर मोबाइल की सिम लेते हैं और अगर आप अपनी सिम को जल्दी शुरू करवाना चाहते हैं तो उसके लिए आप अपने आधार नंबर को दुकानदार को दीजिए और फिर वह दुकानदार आपको आपके हाथ में किसी भी उंगली को अपनी मशीन पर रखो आएगा जिससे की आपके हाथ के जो निशान है वह उस मशीन में आ जाएंगे और फिर आप के आधार कार्ड का वेरीफाई हो जाएगा और उससे आप अपनी सिम को बहुत ही जल्दी शुरू करवा सकते हैं क्योंकि जब आप अपने फिगर को मशीन पर रखेंगे तो वह SIM देने वाली कंपनी के मुख्यालय तक जाते हैं जहां से अभी तुरंत ही अपनी बीवी SIM को चालू कर देते हैं और पहले जब आप ID देते थे उसके बाद तीन चार दिन के बाद कंपनी के मुख्यालय तक वह ID पहुंचती थी उसके बाद आपकी SIM शुरू होती थी इसलिए आजकल ऑनलाइन किसी भी काम को करवाने के लिए भी आधार कार्ड बहुत ही फायदेमंद साबित हो रहा है. और आजकल तो लगभग सभी सरकारी और प्राइवेट कामों के लिए आधार कार्ड होना बहुत ही जरुरी है अगर अगर आपके पास आधार कार्ड नहीं है तो आप को किसी भी सरकारी या प्राइवेट काम को करवाने के लिए बहुत दिक्कत का सामना करना पड़ सकता है क्योंकि आज के समय में आधार कार्ड सभी जगह पर मांगा जाता है आज के समय में आधार कार्ड का बहुत ही ज्यादा महत्व है.आपने वैसे तो बहुत सी तरह के लोन के बारे में सुना होगा ,होम लोन, गाड़ी के लिए लोन, या किसी तरह की कृषि यंत्र के लिए लोन बहुत अच्छी तरह के लोन पर सरकार द्वारा दिए जाते हैं लेकिन आपने शायद यह कभी भी नहीं सुना होगा कि आधार कार्ड से लोन जी हां दोस्तों आज हम आपको इस पोस्ट में आधार कार्ड से लोन लेने के बारे में जानकारी देंगे क्योंकि आप अपने आधार कार्ड से भी लोन ले सकते हैं वह भी पूरे 25 लाख रुपए तक का.""",
    """वैसे तो दोस्तों आप बहुत तरह के अलग-अलग लोन ले सकते हैं क्योंकि आज के समय में लोन कंपनी बहुत ही अच्छे अच्छे लोन दे रही है लेकिन जब आप किसी कंपनी से लोन लेते हैं तो उसके लिए कंपनी आप से पहले कुछ जरूरी डाक्यूमेंट्स लेती है और उनके आधार पर ही कंपनी आपको लोन देती है लेकिन कई लोगों के पास उन डाक्यूमेंट्स को पूरा करना बहुत ही कठिन होता है इसलिए वह लोग लोन नहीं ले पाते तो यदि आप भी लोन लेना चाहते हैं या लोन लेने की सोच रहे हैं तू बेवकूफ तू तो मैं आपको बताता हूं कि आप आधार कार्ड के ऊपर लोन ले सकते हैं वह भी बिना किसी दिक्कत के और आपको आधार कार्ड पर बहुत ही आसानी से मिल जाता है. जब आपको ऑनलाइन लोन लेना पड़ता है तो आपसे बहुत डाक्यूमेंट्स कंपनी मांगती है और उस समय आपको बहुत ज्यादा दिक्कत होती है लेकिन अगर आप ऑनलाइन लोन लेना चाहते हैं आधार कार्ड एक एसी चीज़ है. जिससे कि आप बहुत ही आसानी से ऑनलाइन लोन ले सकते है. आप अपना आधार कार्ड इस्तेमाल करके बहुत ही आसानी से ऑनलाइन लोन ले सकते हैं और यदि आप अपने आधार कार्ड से ऑनलाइन लोन लेना चाहते हैं तो आप इस पर 25 लाख रुपए तक का लोन मिल सकता है.""",
    """"सेवा प्रदाताओं के रूप मैं ऋण और अन्य वित्तीय सेवाएं के लिए आसान पहुँच, अपने ग्राहकों को नो योर कस्टमर(केवाईसी) प्रलेखन के लिए कहे और आधार आपकी पहचान और नागरिकता साबित करने का सबसे अच्छा तरीका है| नागरिकता ,पते, आयु, फोटो और पहचान जैसे कई प्रमाणों के लिए एकल दस्तावेज़| कार्ड का उपयोग ई-केवाईसी,यानि ऑनलाइन सत्यापन के लिए भी किया जा सकता है|""",
    """1 .आधार कार्ड से ऑनलाइन लोन लेना वैसे तो बहुत ही सिंपल है लेकिन इसके लिए आपको कुछ नियमों का पालन करने की जरूरत होती है 2.अगर आपके डॉक्यूमेंट बिल्कुल सही है तो आपको सरकार के द्वारा बहुत ही जल्दी लोन मिल जाता है. 3.आपको उनकी सारी शर्तों को मानना पड़ता है. अगर आपके अंदर लोन को वापस करने की काबिलियत है तो आपको बहुत जल्दी ही लोन दे देते हैं.""",
    """Having an Aadhar card is really very important for indians as the Aadhar card is considered the most important identity card by the government. Let me tell an incident which happened in india-A 5-year-olg girls was lost on the busy streets of India. A person saw the girl crying and took the girl to the police station. The girl was too small to say anything, so they took her fingerprints and hoped that she had an aadhar card. After they checked their systems,they found out the girls Aadhar card Status and the small 5-year-old girls was safely sent to her home!""",
    """यदि आप अपना घर बनवाना चाहते है | और आपके पास इसके लिए पर्याप्त धनराशी नहीं है | साथ ही यदि आप कोई अपना व्यवसाय शुरू करना चाहते हैं | और और आप की आर्थिक स्थिति मजबूत नहीं है | आप अपने व्यवसाय को बढ़ाने के लिए लोन प्राप्त करना चाहते हैं | लेकिन आपके पास किसी प्रॉपर्टी के दस्तावेज नहीं है | जो कि बैंक में लोन प्राप्त करने के लिए गारंटी के तौर पर लगते हैं | तो आप आधार कार्ड पर 25 लाख रुपए तक का लोन प्राप्त कर सकते हैं | आधार कार्ड पर लोन प्राप्त करने के लिए आपको किसी भी प्रकार की कोई गारंटी की आवश्यकता नहीं पड़ती है | आप बैंक या ऑनलाइन ही Aadhar Card Home Loan के लिए आवेदन कर सकते हैं | भारत का कोई भी नागरिक Aadhar Card Home Loan के माध्यम से लोन प्राप्त कर सकता है | भारत सरकार ने देश के नागरिकों की आर्थिक स्थिति मजबूत करने के लिए आधार कार्ड लोन योजना का संचालन कर रहे हैं | इस योजना के अंतर्गत किसानों को छूट भी प्रदान की जाती है |""",
    """आधार कार्ड से ऑनलाइन लोन लेने के लिए आपको किन किन बातों का ध्यान रखना पड़ता है और उसकी कुछ नियम होते हैं वह कौन से नियम हैं जिनका आप को पालन करने की जरूरत होती है नीचे हम आपको उन नियमों के बारे में जानकारी दे रहे हैं तो आप ध्यान से पढ़े 1.आधार कार्ड से ऑनलाइन लोन लेने वाला आदमी लोन को वापस करने में सक्षम होना चाहिए. 2.ऑनलाइन आधार कार्ड से लोन लेने वाला व्यक्ति कम से कम 18 साल की आयु का होना चाहिए. 3.ऑनलाइन लोन लेने वाले आदमी के आधार कार्ड में सारी जानकारी बिल्कुल सही होनी चाहिए. 4.लोन लेने वाला आदमी भारत का होना चाहिए. 5.यदि आप आधार कार्ड से ऑनलाइन लोन लेना चाहते हैं तो उसके लिए आपको एक महीने पहले ही लोन के लिए अप्लाई करना पड़ता है उसके बाद आपको सरकार पैसे देती है 6.यदि आप आधार कार्ड से ऑनलाइन लोन लेना चाहते हैं तो उसके लिए आपके पास अपना मोबाइल नंबर एड्रेस और ईमेल ID होनी चाहिए. 7.आधार कार्ड से ऑनलाइन लोन लेने के लिए सबसे ज्यादा जरूरी आपके पास आपका पैन कार्ड और आपका बैंक अकाउंट जरूर होना चाहिए इसके बाद ही आप आधार कार्ड से ऑनलाइन लोन ले सकते हैं. 8.क्योंकि जब आपके लोन के पैसे आएंगे वह आपको कभी भी सीधे नहीं मिलते ही आपके बैंक अकाउंट के जरिए ही आपके पास आते हैं और इसलिए आपके पास बैंक अकाउंट और पैन कार्ड होना बहुत ही आवश्यक है. हमारे द्वारा बताई गई इन सभी बातों को यदि आप इच्छा पूर्ण पूरा कर लेते हैं तो उसके बाद आपको आधार कार्ड पर ऑनलाइन लोन लेने में बहुत ही आसानी होती है और आप अपने आधार कार्ड से 25 लाख तक का लोन ले सकते हैं.""",
    """अगर आप आधार कार्य पर aadhar card online loan लेना चाहते है तो आपके पास कुछ योग्यता होनी आवश्यक है अगर आप नियम के अनुसार कोई भी योग्यता पूरी नही कर पाते तो आपको online loan नही मिल पायेगा ये योग्यता निम्न प्रकार से है :- आधार कार्य पर ऑनलाइन लोन लेने के लिए आवेदक के पास आधार कार्ड होना अनिवार्य है। आवेदक की आयु 18 वर्ष या उससे अधिक होनी आवश्यक है। आवेदक भारतीय निवासी होना अनिवार्य है। आवेदक लोन चुकाने के सक्षम होना चाहिए आवेदन करने वाले युवक का bank account होना अनिवार्य है। आपके पास mobile number, Email, home address आदि होने जरुरी है। ित्रों सबसे पहले‌ तो मे आपको ये बात बता दु की आपको आधार कार्ड पर बैक‌ द्वारा offline व online दोनो प्रकार के लोन मिल जाते है इसमे से आपको किस माध्यम से लोन लेना है इसका निर्णय ले लीजिए व आप online home loan लेना चाहते है तो आप हमारे बताये गये तरीको को follow कर के आसानी से home loan प्राप्त कर‌ सकते हैं। STEP 1. आधार कार्ड पर online loan लेने के लिए आपको सबसे पहले Aadhar Housing पर् click करके इसकी official Wabsite पर जाना होगा अब आपके सामने एक नया page open होगा उसमे आपको एक drop menu दिखेगा उसपर click करेंhome loan इसमे आपको पूछा जायेगा की आपको किस प्रकार का loan चाहिए आप अपनी जरुरत के अनुसार कोई भी विकल्प चुन ले STEP 3. अब आपके सामने एक नया page open होगा उसमे‌ आपसे कुछ जानकारी मागी जायेगी उस page मे‌ जो जो जानकारी मागी जाती है उसे आप सही सही भर के submit पर click कर दे STEP 4. Submit पर‌ click करने पर अपको एक registration sleep दिखाई देगी आप उसकी print निकाल कर अपने पास सुरक्षित रख ले STEP 5. अब आपको कुछ दिन बाद एक call आयेगा जिसमे आपको कुछ आवश्यक जानकारी पूछी जायेगी व सभी जानकारी देने के बाद आपको किसी नजदीकी office मे document जमा कराने के लिए बुलाया जायेगा वहा आपको अपने document जमा करान होगे STEP 6. सारी process पूरी होने के बाद आपको पैसे लेने के लिए बुलाया जायेगा या पैसे आपके back account मे transfer कर दिए जायेगे""",
    """1. ये लोन लेने के लिये व्यक्ति का‌ भारतीय होना अनिवार्य है। 2. अन्य बैंक से आधार कार्ड पर लोन लिया हुआ नहीं होना चाहिए। 3. लोन लेने‌ वाले व्यक्ति के पास bank passbook, aadhar card , pan card होना आवश्यक हैं। 4. लोन लेने वाला व्यक्ति लोन चुकाने‌ मे सक्षम होना चाहिए 5. लोन‌ लेने वाले‌ व्यक्ति कि उम्र 18 वर्ष या इससे अधिक होनी आवश्यक है""",
    """यदि आधार कार्ड के माध्यम से आधार कार्ड लोन प्राप्त करना चाहते हैं | तो आप बड़ी आसानी से आधार कार्ड के माध्यम से लोन प्राप्त कर सकते हैं | Aadhar Card Home Loan लिए आपको ऑनलाइन या ऑफलाइन किसी एक तरीके से आवेदन करने के लिए निचे दी हुई वेबसाइट की विजिट करे aadharhousing[dot]com.""",
    """1.सबसे पहले आपको अपने किसी ब्राउज़र से आधार हाउसिंग वेबसाइट (Aadharhousing.Com) पर जाना है. 2. इसके बाद जब आपके ब्राउज़र में वेबसाइट ओपन हो जाए तब आपको लेफ्ट साइड में अप्लाई फॉर लोन के ऊपर कलेक्ट करना है. 3. इसके बाद आप अगले पेज पर जाओगे वहां पर आपको लोन के लिए एक फार्म उत्पन्न हुआ हो मिलेगा उसके अंदर आपको अपनी सारी डिटेल भरनी है. 4.उसके बाद आप का सही नाम और आपकी ईमेल ID इसके अंदर भरनी है. 5. आपको ऐसे मोबाइल नंबर को उसके अंदर भरना है जो कि आपके पास हर समय उपलब्ध रहता हो. 6. अगर आप किसी कंपनी में या किसी फैक्ट्री या किसी भी तरह के ऑफिस में काम करते हैं तो आप वहां का लैंडलाइन नंबर भी ऐड कर सकते हैं. 7. उसके बाद आपको आपकी सही जन्म तारीख और आपके शहर का नाम और आपके राज्य का नाम भरना है. 8.उसके बाद आप अपने नजदीक के आधार कार्ड ऑफिस को भरें और फिर आप अपना सही एड्रेस भरे जहां पर आप रहते हैं. 9.उसके बाद आप आपके क्षेत्र का पिन कोड भरेंगे. फिर आपको उसके अंदर यह भरना है कि आप क्या काम करते हैं. 10. उसके बाद आपको यह भरना है कि आप किस काम के लिए आधार लोन लेना चाहते हैं. जैसे फ्लैट लोन, गृह ऋण, गृह नवीकरण, इनमे से कुछ चीजों के लिए. 11.फिर आपको यह करना है कि आप आधार कार्ड से कितने रुपए तक का लोन लेना चाहते हैं और उसके अंदर आपको रुपए भरने हैं 12. फिर आपको आपकी एक महीने की कितनी कमाई है वह भरना है. 13. फिर आपको यह बताना है कि आपको आधार लोन कितने दिन बाद चाहिए 3 महीने 6 महीने या 1 साल बाद इनमें से आपको कुछ एक भरना होता है. 14. और फिर लास्ट में आपको यह भरना है कि आप किस समय उनका कॉल ले सकते हैं यानी कि आप उनके कॉल को किस समय अटेंड कर सकते हैं उस बारे में आपको समय भरना है. फिर जब आप यह सारी जानकारी लेते हैं तो उसके बाद आपकी सारी चीजें पूरी हो जाती है और फिर आप उन्हें एक बार अच्छी तरह से देख कर चेक कर कर सबमिट के ऊपर क्लिक कर दें और जब आपका यह फॉर्म ऑनलाइन आधार लोन के लिए सफल हो जाएगा तो उसके बाद आपको आपके 15 दिन के बाद आपको आपके नजदीकी आधार ऑफिस के अंदर बुलाया जाएगा जो कि आपने इस फोन के अंदर भरा था फिर वहां पर आप उसे आधार ऑफिस के अधिकारी पूरी तरह से जानकारी लेंगे.""",
    """Listed below are the most important benefits of Aadhaar (12 digit unique identity number) Aadhaar based Direct Benefit Transfer (LPG Subsidy):The 12 digit individual identification number on Aadhar card is used to get LPG subsidy amount directly in the bank account 1. LPG Subsidy 2. Jan Dhan Yojana 3. Passport in 10 days 4. Digital Locker 5. Voter Card Linking 6. Monthly Pension 7. Provident Fund 8. Opening new bank account 9. Digital Life Certificate 10.SEBI 11.Mobile number 12.Driving license 13.PAN card and IT return 14.Investments 15.Existing bank account holders 16.Book Upto 12 tickets in IRCTC website in a month by linking Aadhaar"""
  ];
}

